Tekla Open API Reference for Tekla Structures 2025
Double Methods
The Double type exposes the following members.
Methods
Name | Description
CompareTo
 Compares the current object with another object of the same type.
Equals(Object)
 Returns a value that indicates whether the current instance is equal to the given object.
 (Overrides ValueType.Equals(Object).)
Equals(Double)
 Indicates whether the current object is equal to another object of the same type.
GetHashCode
 Returns the hash code for the current instance.
 (Overrides ValueType.GetHashCode().)
GetSchema
 Gets the XML Schema for the datatype.
ReadXml
 Parses a new value from the given reader.
ToString
 Returns the string representation of the object.
 (Overrides ValueType.ToString().)
WriteXml
 Writes the value as XML to the given writer.
Top
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace